benchmark-results/pgbench_18_standard_20250815_131335.log
pgbench (18beta3)
starting vacuum...end.
progress: 30.0 s, 3589.4 tps, lat 5.542 ms stddev 11.901, 0 failed
progress: 60.0 s, 3595.8 tps, lat 5.554 ms stddev 12.326, 0 failed
progress: 90.0 s, 3421.1 tps, lat 5.845 ms stddev 9.824, 0 failed
progress: 120.0 s, 3436.4 tps, lat 5.802 ms stddev 10.757, 0 failed
progress: 150.0 s, 3598.0 tps, lat 5.559 ms stddev 12.121, 0 failed
progress: 180.0 s, 3476.4 tps, lat 5.744 ms stddev 13.666, 0 failed
progress: 210.0 s, 3466.6 tps, lat 5.752 ms stddev 11.809, 0 failed
progress: 240.0 s, 3550.2 tps, lat 5.625 ms stddev 12.475, 0 failed
progress: 270.0 s, 3479.4 tps, lat 5.747 ms stddev 11.254, 0 failed
progress: 300.0 s, 3581.7 tps, lat 5.568 ms stddev 11.571, 0 failed
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 20
number of threads: 4
maximum number of tries: 1
duration: 300 s
number of transactions actually processed: 1055871
number of failed transactions: 0 (0.000%)
latency average = 5.673 ms
latency stddev = 11.822 ms
initial connection time = 68.269 ms
tps = 3520.138174 (without initial connection time)